ИТ_Фирма/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <registerRecords>InformationRegister.ЦеныПродажиНоменклатуры</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Денежный</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИТ_Фирма/src/Documents/УстановкаЦен/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Функция ПриИзмененииНоменклатуры(ИзмененнаяСтрока)

	Если ЗначениеЗаполнено(ИзмененнаяСтрока.Номенклатура) Тогда
		 Возврат ЦеныВызовСервера.ЦенаНаДату(ИзмененнаяСтрока.Номенклатура, Объект.Дата);
	Иначе
		Возврат 0;
	КонецЕсли;	

КонецФункции	


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Согласовано Тогда 
		Элементы.Контрагент.Доступность = Ложь;
		Элементы.Комментарий.Доступность = Ложь;
		Элементы.Ответственный.Доступность = Ложь;
		Элементы.Номер_Дата.Доступность = Ложь;
		Элементы.Цены.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЦеныНоменклатураПриИзменении(Элемент)
	
	ТекДанные = Элементы.Цены.ТекущиеДанные;
	ТекДанные.Цена = Ждать ПриИзмененииНоменклатуры(ТекДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыОтбора, Элементы.Цены); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЦеныОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", ВыбранноеЗначение);
	НайденныеСтроки = Объект.Цены.НайтиСтроки(ПараметрыОтбора);
	
	Если НайденныеСтроки.Количество() <> 0 Тогда  
		
		ПоказатьПредупреждение(,"Выбранная номенклатура уже есть в списке",,"Обнаружены дубли номенклатуры!");
		Возврат;
		
	КонецЕсли; 
		
	НоваяСтрокаТЧ = Объект.Цены.Добавить(); 
	НоваяСтрокаТЧ.Номенклатура = ВыбранноеЗначение;
	НоваяСтрокаТЧ.Цена = ПриИзмененииНоменклатуры(НоваяСтрокаТЧ);
	 	
	
КонецПроцедуры
